<?
$MESS ['ID_TIP'] = "Поле содержит код, в котором передается ID тех разделов или элементов, для которых создаются пункты меню. По умолчанию содержит ={\$_REQUEST[\"ID\"]}";
$MESS ['IBLOCK_TYPE_TIP'] = "Т.к. компонент создан как пример выборки информации из инфоблоков для создания пунктов меню, то в данном поле в выпадающем списке перечислены все типы инфоблоков, созданные в системе.";
$MESS ['IBLOCK_ID_TIP'] = "Выбирается нужный инфоблок из созданных для указанного типа.";
$MESS ['SECTION_URL_TIP'] = "Указывается URL, ведущий на страницу с содержимым раздела";
$MESS ['DETAIL_URL_TIP'] = "Указывается URL, ведущий на страницу с содержимым элемента";
$MESS ['CACHE_TYPE_TIP'] = "<i>Авто</i>: действует при включенном кешировании в течение заданного времени;<br /><i>Кешировать</i>: для кеширования необходимо только определить время кеширования;<br /><i>Не кешировать</i>: кеширования нет в любом случае.";
$MESS ['CACHE_TIME_TIP'] = "Поле служит для указания времени кеширования в секундах.";
$MESS ['DEPTH_LEVEL_TIP'] = "Сколько уровней вложенности выводить.";
$MESS ["SECTION_PAGE_URL_TIP"] = "Для перехода на страницу раздела в качестве параметра должно передаваться ID раздела (#SECTION_ID#). По умолчанию поле содержит #SECTION_ID#/. Если разделы в инфоблоке не заданы, то поле требуется оставить пустым.";
$MESS ["DETAIL_PAGE_URL_TIP"] = "В данном поле указывается путь к странице детального просмотра. В качестве параметра должно передаваться ID элемента.";
$MESS ["ELEMENT_SORT_FIELD_TIP"] = "В списке перечислены поля, по которым может проводиться сортировка. Также можно выбрать пункт <i>другое</i> и задать в поле рядом код нужного поля.";
$MESS ["ELEMENT_SORT_ORDER_TIP"] = "По возрастанию либо по убыванию.";
?>